app/views/users/_form.html.erb

    <!--<%= f.number_field :project_id %>-->
    <%= collection_select(:user, :project_id, Project.all, :id, :title, prompt: true) %>
---
SELECT "projects".* FROM "projects"
SELECT "users".* FROM "users"