app/controllers/users_controller.rb

INSERT INTO "users" ("name", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "khushi"], ["project_id", 1], ["created_at", "2015-05-26 20:10:29.893198"], ["updated_at", "2015-05-26 20:10:29.893198"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "name" = ?, "project_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "monika"], ["project_id", 1], ["updated_at", "2015-05-26 20:45:41.941581"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)